Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་ལྷའི་བུ་མོའི་ཚོགས་ཀྱིས་བསྐོར་ནས། ནམ་ཕྱེད་ཙམ་ན་ཀླུང་ནཻ་རན་ཛ་ནའི་འགྲམ་ག་ལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ག་ལ་བ་དེར་སོང་བ་དང་། དེས་བྱང་ཆུབ་སེམས་དཔའ་ལུས་སྐམས་ཤིང་འཆི་བའི་དུས་བྱས་པ་དང་འདྲ་བ་མཐོང་ངོ་།
en: Māyādevī surrounded herself with a retinue of goddesses, and at midnight they went to the bank of the Nairañjanā River where the Bodhisattva was staying. She saw how thin the Bodhisattva had become, and it appeared as if he had died.

source: །མཐོང་ནས་མཆི་མས་བརྣངས་ཤིང་ངུས་ནས།
en: Upon seeing this, she was choked with tears and began to weep.

source: །ལུམ་བི་ནི་ཞེས་བྱ་བའི་ཚལ་དུ་ང་བུ་བཙས་པའི་ཚེ།
en: “When I gave birth to you, my son, in the Lumbinī Grove,

source: །སེང་གེ་བཞིན་དུ་འཛིན་པ་མེད་པར་གོམ་བདུན་ཁྱོད་ཉིད་སོང་།
en: Without support, like a lion, you took seven steps on your own.

source: །ཕྱོགས་བཞིར་བལྟས་ཤིང་འདི་ནི་ང་ཡི་སྐྱེ་བ་ཐ་མ་ཞེས། །ཁྱོད་ཀྱིས་ཚིག་སྙན་སྨྲས་པ་དེ་ཡང་ཁྱོད་ལ་ཡོང་མ་རྫོགས།
en: You gazed in the four directions and said these beautiful words: ‘This is my last birth.’ Those words will now never come to pass.

source: །འཇིག་རྟེན་སངས་རྒྱས་འགྱུར་ཞེས་དྲང་སྲོང་ནག་པོས་བསྟན་པ་ཡི།
en: “Asita predicted that you would be a buddha in this world,

source: །དེ་ཡི་ལུང་བསྟན་པ་ཡང་ཉམས་ལ་མི་རྟག་དེས་མ་མཐོང་།
en: But his prediction was wrong, as he did not foresee impermanence.

source: །བུས་ནི་ཡིད་དགའ་འཁོར་ལོས་སྒྱུར་བའི་དཔལ་ཡང་མ་མྱོང་ལ།
en: My son, you have not yet had the joys of a universal monarch’s splendors,

source: །བྱང་ཆུབ་ཀྱང་ནི་རྗེས་སུ་མ་ཐོབ་ཚུལ་དུ་ཤི་བར་གྱུར།
en: And now you are passing away in this forest without attaining awakening.

source: །བུ་ཕྱིར་སུ་ལ་བསྒྲུབ་ཕྱིར་སྡུག་བསྔལ་སུ་ཡི་གན་དུ་མདུད།
en: “To whom can I turn to about my son? To whom shall I cry out in my pain?

source: །བདག་གི་བུ་གཅིག་ཅུང་ཟད་གསོན་པའི་སྲོག་ནི་སུ་ཡིས་སྦྱིན།
en: Who will give life back to my only son, Who is barely alive?”

source: ཤིན་ཏུ་སྙིང་རྗེ་བར་ནི་ངུ་བྱེད་ཅིང་།
en: “Who are you? You cry so heart wrenchingly,

source: །སྐྲ་ཡང་བཤིག་ལ་མཛེས་པ་རྣམས་བོར་བ།
en: With disheveled hair and your beauty impaired,

source: །ཤིན་ཏུ་བུ་ཡི་སྨྲེ་སྔགས་འདོན་བྱེད་ལ།
en: Lamenting your son so intensely

source: །ས་སྟེང་འདུག་ཅིང་འགྲེང་བ་འདི་སུ་ཞིག།
en: And throwing yourself on the ground.”

source: །ལྷ་མོ་སྒྱུ་འཕྲུལ་གྱིས་སྨྲས་པ།
en: Māyādevī replied:

source: །བདག་གིས་ཟླ་བ་བཅུ་བར་དུ། །རྡོ་རྗེ་འདྲ་བ་མངལ་དུ་བཅངས། །བུ་དེའི་མ་ནི་བདག་ཡིན་ཏེ།
en: “It is I, your mother, O son, Who for ten months Carried you in my womb like a diamond.

source: །རབ་ཏུ་སྡུག་བསྔལ་རྣམ་པར་སྨྲེ།
en: It is I who now cry out in despair.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མའི་དབུགས་འབྱིན་ཅིང་སྨྲས་པ།
en: Then, in order to console her, the Bodhisattva told her,

source: བུ་ལ་བྱམས་པ་ཁྱོད་ཀྱི་ངལ་བ་འབྲས་བུ་ཡོད་པར་བྱས།
en: “As for grieving for your son, there is no need to worry;

source: མ་འཇིགས་ཤིག །
en: your hardship will pay off.

source: སངས་རྒྱས་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བཏང་བ་ནི་དོན་ཡོད་པ་སྟེ།
en: Renouncing the world for the sake of awakening is indeed meaningful.

source: དྲང་སྲོང་ནག་པོས་བསྟན་པ་ཡང་མངོན་དུ་གསལ་བར་བྱའོ།
en: What the priest Asita predicted shall come true.

source: །མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་པ་ཡང་མངོན་དུ་གསལ་བར་བྱའོ།
en: Likewise the prediction of Dīpaṃkara shall come to pass.

source: །ས་ནི་རྣམ་བརྒྱར་འཐོར་བར་འགྱུར་ཡང་སྲིད། །རིན་ཆེན་རྩེ་མོ་ལྷུན་པོ་ཆུར་འཕྱོ་སྲིད།
en: “It is possible that the world may break into a hundred pieces, and the jewel peak of Mount Meru may fall into the ocean.

source: །ཉི་ཟླ་སྐར་ཚོགས་ས་ལ་ལྟུང་འགྱུར་སྲིད།
en: The sun, the moon, and the stars may fall to the ground.

source: །སོ་སོའི་སྐྱེ་བོ་ཡིན་ཡང་ང་མི་འཆི།
en: Yet although I am an ordinary person, I will not die.

source: །དེ་ཕྱིར་འདི་ལ་མྱ་ངན་ཁྱོད་མ་བྱེད།
en: Therefore do not bring misery on yourself.

source: །རིང་པོར་མི་ཐོགས་བྱང་ཆུབ་སངས་རྒྱས་མཐོང་།
en: Before long you shall behold the awakening of a buddha.”

source: །ལྷ་མོ་སྒྱུ་འཕྲུལ་གྱིས་ཐོས་མ་ཐག་ཏུ་རབ་ཏུ་དགའ་སྟེ་བ་སྤུ་གཡོས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་མེ་ཏོག་མན་དཱ་ར་བས་གཏོར་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ལྷའི་སིལ་སྙན་དཀྲོལ་ཞིང་། རང་གི་གནས་ག་ལ་བ་དེར་སོང་ངོ་།
en: As soon as Māyādevī heard this, she became overjoyed, and the hair on her body stood on end. Sprinkling the Bodhisattva with māndārava flowers, she circumambulated him three times. Then, accompanied by heavenly music, she went back to her abode.

source: དགེ་སློང་དག་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་དག་ཁ་ཅིག་ཟས་ཆུང་ངུས་དག་པར་སེམས་པ་ཡོད་ཀྱིས། ངས་ཀྱང་ཟས་ཆུང་ངུ་ལ་ནན་ཏན་བྱའོ་སྙམ་མོ། །དགེ་སློང་དག་ངས་མངོན་པར་ཤེས་ཏེ། ཟས་སུ་རྒྱ་ཤུག་འབྲུ་གཅིག་པུ་ཁོ་ན་སྟེ་གཉིས་སུ་མེད་པར་ཟོས་སོ།
en: Monks, at that point I thought to myself, “Because some religious practitioners and priests believe that one becomes purified by eating very little food, I must also be diligent in fasting.” Monks, I realized that I should henceforth live on a single juniper berry and restrain myself from eating two.

source: །དགེ་སློང་དག་ཁྱེད་ཀྱི་བློ་འདི་སྙམ་དུ་དེའི་ཚེའི་རྒྱ་ཤུག་ཆེ་བ་སྙམ་དུ་སེམས་པར་གྱུར་ན་དེ་ལྟར་མི་བལྟ་སྟེ་དེའི་ཚེའི་རྒྱ་ཤུག་ཀྱང་འདི་ཉིད་ཙམ་མོ།
en: Monks, you might think that the juniper berries of that time were larger than now, but that is not the case.

source: །དགེ་སློང་དག་ངས་ཟས་སུ་རྒྱ་ཤུག་འབྲུ་གཅིག་པུ་ཁོ་ན་སྟེ་གཉིས་སུ་མེད་པ་ཟོས་པས་ལུས་ཤིན་ཏུ་ཉམ་ཆུང་ཞིང་རིད་པར་གྱུར་ཏོ།
en: They were just as they are now. Monks, as I now began living on just a single juniper berry, never taking a second, my body became extremely weak and emaciated.

source: །དགེ་སློང་དག་འདི་ལྟ་སྟེ་དཔེར་ན་ལྡུམ་བུ་ཨ་སི་ཏ་ཀའི་ཚིགས་པ་དང་། ཀ་ལི་ཀའི་ཚིགས་པ་ཅི་འདྲ་བར་ངའི་ཡན་ལག་དང་ཉིང་ལག་རྣམས་ཀྱང་དེ་འདྲ་བར་གྱུར་ཏོ།
en: Monks, my limbs and joints began to resemble the knots of the āsītakī plant or the kālā plant.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་སྲོག་ཆགས་ཀར་ཀ་ཏ་ཀའི་རྩིབ་ལོགས་ཅི་འདྲ་བར་ངའི་རྩིབ་ལོགས་ཀྱང་དེ་འདྲ་བར་གྱུར་ཏོ།
en: My rib cage resembled the sides of a crab.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་བཞོན་པའི་བྲེས་ཁང་ངམ། གླང་པོའི་བྲེས་ཁང་རྙིང་པ་ངོས་གཉིས་ཞིགས་པ་ནི་གདུང་རྟེན་གྱི་བར་སྣང་ཞིང་མངོན་ནོ། །དེ་བཞིན་དུ་ངའི་རྩིབ་ལོགས་གཉིས་ཀ་ནས་ལུས་ཀྱི་ནང་སྣང་ཞིང་མངོན་ནོ།
en: Like an old stable for horses or elephants where the two sides have caved in and made the inside rafters visible, the insides of my chest became visible through both sides of my ribs.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ལན་བུར་བླས་པ་ནི་མཐོན་དམན་དང་མཉམ་པ་དང་མི་མཉམ་པར་གྱུར་ཏོ། །དེ་བཞིན་དུ་ངའི་སྒལ་ཚིགས་ཀྱང་མཐོན་དམན་དང་མཉམ་པ་དང་མི་མཉམ་པར་གྱུར་ཏོ།
en: My spine appeared uneven and rugged, like a braid of hair with all its ups and downs.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ཀུབ་ཁ་བོ་གཞོན་ནུར་བཅད་པ་ནི་རྙིས་པ་དང་། ཀུན་ཏུ་རྙིས་པ་དང་རྩུམ་རྩུམ་པོར་འགྱུར་རོ། །དེ་བཞིན་དུ་ངའི་མགོ་ཡང་རྙིས་པ་དང་ཀུན་ཏུ་རྙིས་པ་དང་རྩུམ་རྩུམ་པོར་གྱུར་ཏོ།
en: Just as a bitter gourd that has been cut too early withers, dries out, and develops cracks, likewise my head began to wither, dry out, and develop cracks.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་སོས་ཀའི་ཟླ་བ་ཐ་མ་ལ་ཁྲོན་པའི་སྐར་མ་དམའ་བར་སོང་སྟེ་ཚེགས་ཆེན་པོས་སྣང་བར་འགྱུར་རོ། །དེ་བཞིན་དུ་ངའི་མིག་གི་འབྲས་བུ་ཡང་ཁུང་དུ་སོང་སྟེ་ཚེགས་ཆེན་པོས་སྣང་བར་གྱུར་ཏོ།
en: Just like a well during the end of summer, where the reflection of the stars has sunk and is hard to notice, my eyeballs had sunk into my head and become barely visible.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ངའི་རྐང་པའམ་རྔ་མོའི་རྐང་པ་ཅི་འདྲ་བར་ངའི་མཆན་ཁུང་དང་ལྟོ་དང་བྲང་ལ་སོགས་པ་ཡང་དེ་འདྲ་བར་གྱུར་ཏོ།
en: My legs resembled the legs of a goat or a camel, and so it was for my armpits, belly, chest, and so forth.

source: །དགེ་སློང་དག་དེ་ནས་ང་གང་གི་ཚེ་ལག་པས་ལྟོ་བ་ལ་བྱུག་གོ་སྙམ་ན་སྒལ་ཚིགས་ཉིད་ལ་རེག་གོ།
en: Monks, when at that point I tried touching my belly with my hand, I actually ended up touching my spine.

source: །ལྡང་ངོ་སྙམ་ནས་ལངས་ན་ཡང་དེ་བཞིན་དུ་སྒུར་པོར་གྱུར་ཏེ་འགྱེལ་ཏོ།
en: I was so hunched over that I fell whenever I tried to stand.

source: །ཤ་ཐང་སྟེ་ལངས་ནས་རྡུལ་གྱིས་ལུས་ཡོག་པ་ལག་པས་ཕྱིས་པ་དང་། བ་སྤུ་རུལ་བ་ཐམས་ཅད་ལུས་ལས་ལྷགས་སོ།
en: When I finally managed to get up and wipe my dust-covered body with my hands, my decayed hair fell out of my body.

source: །གང་སྔོན་ང་ཁ་དོག་མཛེས་ཤིང་འཇམ་པར་གྱུར་པ་དེ་ཡང་འདི་ལྟར་བདག་ཉིད་སྤོང་བ་རྩུབ་པོར་བཏང་བས་མེད་པར་གྱུར་ཏོ།
en: Previously my complexion had been beautiful and smooth, but now this radiance was all gone due to exerting myself in harsh travails.

source: །ངའི་སྤྱོད་ཡུལ་གྱི་གྲོང་ན་གནས་པའི་སྐྱེ་བོ་ཉེན་ཀོར་བ་རྣམས་ཀྱང་ང་ལ་འདི་ལྟར། ཨེ་མའོ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་གནག་གོ། །ཨེ་མའོ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་སྔོ་བསངས་སོ།
en: The people who lived in the villages surrounding the area where I was practicing began to say, “Oh my, the mendicant Gautama has turned black!

source: །ཨེ་མའོ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་ཉ་མང་ཀུ་རའི་མདོག་འདྲའོ།
en: Have you seen, he’s so dark! The mendicant Gautama has the color of the madgura fish!

source: །སྔོན་འདིའི་མདོག་མཛེས་པ་གསལ་བར་གྱུར་པ་དེ་ཡང་མེད་པར་གྱུར་ཏོ་སྙམ་དུ་ཤེས་སོ།
en: Previously his complexion was so beautiful, but now it has all changed.”

source: །དགེ་སློང་དག་ངས་འདི་སྙམ་དུ་བསམས་ཏེ་བདག་གིས་དེ་བས་ཀྱང་ཟས་ཆུང་ངུ་ལ་ནན་ཏན་བྱའོ་སྙམ་མོ། །དགེ་སློང་དག་ངས་མངོན་པར་ཤེས་ཏེ། ངས་ཟས་སུ་འབྲས་འབྲུ་གཅིག་པུ་ཁོ་ན་སྟེ། གཉིས་སུ་མེད་པ་ཟོས་སོ།
en: Monks, at that point I thought to myself, “I must apply myself to eating even less than this.” I realized that I should henceforth live on only a single grain of rice and restrain myself from eating two.

source: །དགེ་སློང་དག་ཁྱོད་འདི་སྙམ་དུ་དེའི་ཚེའི་འབྲས་ཆེ་བ་སྙམ་དུ་སེམས་པར་གྱུར་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Monks, you may think that the rice grains of that time were larger than now, but that is not the case.

source: དེའི་ཚེ་འབྲས་ཀྱང་འདི་ཉིད་ཙམ་མོ།
en: They were just as they are now.

source: །དགེ་སློང་དག་ངས་ཟས་སུ་འབྲས་འབྲུ་གཅིག་ཟོས་པས་ལུས་མྱུར་དུ་སྔ་མ་བཞིན་དུ་གྱུར་ཏེ།
en: Monks, as I now lived on only a single grain of rice, my body quickly grew thinner, and people began to say, “Oh my! The mendicant Gautama has turned black! Have you seen, he’s so dark!

source: ཨེ་མའོ་དགེ་སྦྱོང་གཽ་ཏ་མ་ཉ་མད་ཀུ་རའི་མདོག་འདྲའོ།
en: The mendicant Gautama has the color of the madgura fish!

source: །སྔོན་འདིའི་མདོག་མཛེས་པ་གསལ་བར་གྱུར་པ་དེ་ཡང་མེད་པར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Previously his complexion was so beautiful, but now it has all changed.”

source: །དགེ་སློང་དག་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། བདག་གིས་དེ་བས་ཀྱང་ཟས་ཆུང་ངུ་ཉིད་ལ་ནན་ཏན་བྱའོ་སྙམ་མོ། །དགེ་སློང་དག་ངས་མངོན་པར་ཤེས་ཏེ། ངས་ཟས་སུ་ཏིལ་འབྲུ་གཅིག་པུ་ཁོ་ན་སྟེ་གཉིས་སུ་མེད་པ་ཟོས་པ་ནས། དེའི་ཁ་དོག་འཇམ་པོ་མེད་པར་གྱུར་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ།
en: Monks, at that point I thought to myself, “I must apply myself to eating even less than this.” I realized that I should henceforth live on only a single sesame seed and restrain myself from eating two. Just as before, I grew even thinner, and people continued to remark on how my previously beautiful complexion had disappeared.

source: །དགེ་སློང་དག་ངས་འདི་སྙམ་དུ་བསམས་ཏེ། དགེ་སྦྱོང་དང་བྲམ་ཟེ་གང་དག་ཁ་ཅིག་ཟས་མི་ཟ་བས་དག་པར་སེམས་ཏེ། བདག་གིས་ཀྱང་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཟས་མི་ཟ་བར་ནན་ཏན་བྱའོ་སྙམ་ནས། དགེ་སློང་དག་དེ་ནས་ཟས་མི་ཟ་བར་འདུག་གོ།
en: Monks, I then thought to myself, “There are some monks and priests who believe that they are purified by abstaining from eating food. I should also apply myself to completely abstaining from any food.” Monks, I then began a complete fast.

source: །དགེ་སློང་དག་ངས་ཟས་མ་ཟོས་པས་ལུས་ཤིན་ཏུ་སྐམས་ཤིང་ཉམ་ཆུང་བ་དང་རིད་པར་གྱུར་ཏོ།
en: Monks, as I now began living without any sustenance, my body became extremely weak and emaciated.

source: །འདི་ལྟ་སྟེ་དཔེར་ན་ལྡུམ་བུ་ཨ་སི་ཏ་ཀའི་ཚིགས་པ་དང་། ཀ་ལི་ཀའི་ཚིགས་པ་བས་ཀྱང་ཉིས་འགྱུར་དང་། སུམ་འགྱུར་དང་། བཞི་འགྱུར་དང་། ལྔ་འགྱུར་དང་། བཅུ་འགྱུར་གྱིས་ངའི་ཡན་ལག་དང་། ཉིང་ལག་སྐེམས་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་རྩིབ་ལོགས་ནི་སྲོག་ཆགས་ཀར་ཀ་ཏ་ཀའི་རྩིབ་ལོགས་དང་། བཞོན་པའི་བྲེས་ཁང་ལྟ་བུར་གྱུར་ཏོ།
en: Monks, my limbs and joints gradually became twice, three times, four times, five times, and finally ten times as thin as the knots of the āsītakī and kālā plants. My rib cage resembled the sides of a crab, and it looked like a collapsed stable with rafters exposed on either side.

source: །སྒལ་ཚིགས་ནི་ལན་བུ་བླས་པ་ལྟ་བུར་གྱུར་ཏོ།
en: My spine appeared like a braided tuft of hair.

source: །མགོའི་ཐོད་པ་ནི་ཀུ་བ་ཁ་བོ་ལྟ་བུར་གྱུར་ཏོ།
en: My skull looked like a cracked gourd.

source: །མིག་གི་འབྲས་བུ་ནི་ཁྲོན་པའི་སྐར་མ་ལྟ་བུར་གྱུར་ཏོ།
en: My eyeballs appeared like stars in a sunken well.

source: །དགེ་སློང་དག་ང་ལེགས་པར་ལྡང་ངོ་སྙམ་ནས་ལུས་ཀྱིས་བསྐྱོད་ན། སྒུར་པོར་གྱུར་ཏེ་འགྱེལ་ཏོ།
en: Monks, whenever I thought I should stand up, I tried to do so, but my body was so hunched over that I fell every time.

source: །ཤ་ཐང་སྟེ་ལངས་ནས་རྡུལ་གྱིས་ལུས་ཡོག་པ། ལག་པས་ཕྱིས་པ་དང་། བ་སྤུ་རུལ་པ་ཐམས་ཅད་ལུས་ལས་ལྷགས་སོ།
en: When I finally managed to get up with great effort and wipe my dust-covered body with my hands, my body hair, its roots rotten, came out of my body.

source: །གང་སྔོན་ང་ཁ་དོག་མཛེས་ཤིང་འཇམ་པར་གྱུར་པ་དེ་ཡང་འདི་ལྟར་བདག་ཉིད་སྤོང་བ་རྩུབ་པོར་བཏང་བའི་ཕྱིར་མེད་པར་གྱུར་ཏོ།
en: Previously my complexion had been beautiful and smooth, but now this radiance had disappeared because of exerting myself in extreme austerities.

source: །ངའི་སྤྱོད་ཡུལ་གྱི་གྲོང་ན་གནས་པའི་སྐྱེ་བོ་ཉེན་ཀོར་བ་རྣམས་ཀྱང་། འདི་ལྟར་ཨེ་མའོ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་གནག་གོ། །ཨེ་མའོ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་སྔོ་བསངས་སོ།
en: The people who lived in the villages surrounding the area where I was practicing began to say, “Oh my, the mendicant Gautama has turned black!

source: །ཨེ་མའོ་དགེ་སྦྱོང་གཽ་ཏ་མ་ནི་ཉ་མད་ཀུ་རའི་མདོག་འདྲའོ།
en: Have you seen, he’s so dark! The mendicant Gautama has the color of the madgura fish!

source: །སྔོན་འདིའི་ཁ་དོག་མཛེས་པ་གསལ་བར་གྱུར་པ་དེ་ཡང་མེད་པར་གྱུར་ཏོ་སྙམ་དུ་ཤེས་སོ།
en: Previously his complexion was so beautiful, but now it has all changed.”

source: །དེའི་ཚེ་རྒྱལ་པོ་ཟས་གཙང་མ་ཡང་ཉིན་རེ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་དྲུང་དུ་ཕོ་ཉ་གཏོང་ངོ་།
en: During this time King Śuddhodana sent a messenger every day to see the Bodhisattva.

source: །དགེ་སློང་དག་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སྔ་མ་བཞིན་དུ་འཇིག་རྟེན་དུ་བྱ་བ་རྨད་དུ་བྱུང་བ་བསྟན་པ་དང་། བྱ་བ་ཉམས་པའི་སེམས་ཅན་རྣམས་ལས་དང་བྱ་བ་ལ་གཟུད་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་རྣམས་བརྗོད་པ་དང་། ཡེ་ཤེས་ཆེན་པོའི་ཡོན་ཏན་བསྟན་པ་དང་། བསམ་གཏན་གྱི་ཡན་ལག་རྣམས་རྣམ་པར་དབྱེ་བའི་ཕྱིར་ཏིལ་འབྲུ་གཅིག་དང་། རྒྱ་ཤུག་འབྲུ་གཅིག་དང་། འབྲས་འབྲུ་གཅིག་གིས་ལོ་དྲུག་གི་བར་དུ་དཀའ་བ་སྤྱོད་པ་བསྟན་ཏེ་ཡིད་དམན་པ་མེད་དོ།
en: Monks, in this way the Bodhisattva displayed true wonders to the world. He did so in order to shatter the proud satisfaction of extremists, to vanquish the opponents’ attacks, to attract the gods, and to show the nihilists and eternalists, who disregard karmic action and the ripening of karmic results. He lived on just a single sesame seed, a single juniper berry, and a single grain of rice in order to demonstrate the accumulation of merit, to teach the qualities of great wisdom, and to distinguish the levels of absorption. In this way he demonstrated hardships for six years without ever weakening his resolve.

source: །བྱང་ཆུབ་སེམས་དཔའ་ལོ་དྲུག་གི་བར་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས།
en: The Bodhisattva remained sitting cross-legged for six years.

source: ཇི་ལྟར་འདུག་པ་བཞིན་དུ་གནས་ཏེ། སྤྱོད་ལམ་ཉམས་པ་མེད་དོ།
en: He simply sat the way he was, without forsaking his activity.

source: །ཉི་མས་བབ་ནས་ཀྱང་གྲིབ་མ་ལ་མ་སོང་ངོ་།
en: When the sun was shining, he did not seek shade.

source: །གྲིབ་མ་ལས་ཀྱང་ཉི་མ་ལ་མ་སོང་ངོ་།
en: When the shade fell on him, he did not move into the sun.

source: །རླུང་དང་ཉི་མ་དང་ཆར་པའི་སྐྱབས་མ་བཙལ་ཏོ།
en: Never did he seek shelter from the wind, the sun, and the rain.

source: །ཤ་སྦྲང་དང་། སྦྲང་བུ་དང་། སྡིག་སྦྲུལ་མ་བསྐྲད་དོ།
en: He never chased away mosquitoes, bees, and poisonous snakes.

source: །བཤང་བ་དང་། གཅི་བ་དང་། མཆིལ་མ་དང་། སྣབས་མ་བོར་རོ། །བསྐུམ་པ་དང་། སྨྱང་བ་མ་བྱས་སོ། །གློས་ཕབ་པའམ། ཁས་བུབའམ།
en: He did not defecate, urinate, spit, or blow his nose.

source: གན་རྐྱལ་མ་ཡིན་པར་གནས་པས་གནས་སོ།
en: Neither did he bend his limbs or stretch them out.

source: །སྤྲིན་ཆེན་པོ་དང་། ཡུལ་ངན་ཆེན་པོ་དང་། ཆར་པ་དང་། སེར་བ་དང་། སྟོན་དང་། དཔྱིད་དང་། དགུན་གང་ཡིན་པ་དེ་དག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་མ་ཕོག་གོ།
en: He never lay down on his belly, side, or back. The hot season, the winter, and the great clouds, storms, rain, and lightning of autumn all assailed the body of the Bodhisattva.

source: །ཐ་ན་བྱང་ཆུབ་སེམས་དཔས་ལག་པས་ཀྱང་མ་བསྐྱབས་སོ།
en: In fact the Bodhisattva did not even use his hand to shelter himself.

source: །དབང་པོ་ཡང་མ་བཀག་གོ། །དབང་པོའི་ཡུལ་ཡང་མ་བླངས་སོ།
en: He did not block his senses, but neither did he follow after the objects of his senses.

source: །གང་དག་དེར་འོང་བ་གྲོང་གི་གཞོན་ནུའམ། གྲོང་གི་གཞོན་ནུ་མའམ། བ་ལང་རྫིའམ། ཕྱུགས་རྫིའམ། རྩྭ་ཐུན་ནམ། ཤིང་ཐུན་ནམ། ལྕི་ཐུན་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་རྡུལ་ཁྲོད་ཀྱི་འདྲེ་ཡིན་པ་སྙམ་དུ་སེམས་ཤིང་དེ་ལ་རྩེན་ཏེ། དེ་ལས་ས་སྐུད་དོ།
en: Those who passed by the Bodhisattva, such as village boys or girls, ox herders, cow herders, grass collectors, wood collectors, and those looking for dung, all thought he was a demon made of dust. They made fun of him and sprinkled him with dust.

source: །དེར་བྱང་ཆུབ་སེམས་དཔའ་ལོ་དྲུག་པོ་དེ་དག་གིས་ལུས་ངན་པ་དང་། གོད་པ་དང་རིད་པར་གྱུར་ཏེ།
en: In this way the Bodhisattva spent six years, during which time his body became increasingly feeble, weak, and emaciated.

source: དེའི་རྣ་བ་གཉིས་སུ་རྩྭ་འམ་ཤིང་བལ་བཅུག་ནས་སྣའི་བུ་ག་གཉིས་སུ་འབྱིན་ཏོ།
en: When people placed grass or cotton in his ears, it would stick out of his nostrils.

source: །སྣའི་བུ་ག་གཉིས་སུ་བཅུག་ནས་རྣ་བའི་བུ་ག་གཉིས་སུ་འབྱིན་ཏོ།
en: When they did the same with his nostrils, the grass and cotton would emerge from his ears.

source: །རྣ་བའི་བུ་ག་གཉིས་སུ་བཅུག་ནས་ཁར་འབྱིན་ཏོ།
en: When they placed things in his ears, they would stick out of his mouth.

source: །ཁར་བཅུག་ནས་རྣ་བ་དང་སྣའི་བུ་གང་འབྱིན་ཏོ།
en: And when they stuffed things in his mouth, they would come out of his ears and nose.

source: །སྣར་བཅུག་ནས་རྣ་བ་དང་། སྣ་དང་ཁར་འབྱིན་ཏོ།
en: Things put in his nostrils would appear out of his ears, nose, and mouth.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་དག་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་མངོན་སུམ་དུ་གྱུར་པ་དེ་དག་ཉིན་མཚན་དུ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་མཆོད་པ་བྱེད་དོ། །སྨོན་ལམ་ཡང་འདེབས་སོ།
en: The gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas who witnessed the qualities of the Bodhisattva watched over him day and night, making offerings and forming aspirations.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལོ་དྲུག་གི་བར་དུ་དཀའ་བ་སྤྱོད་པ་སྟོན་ཅིང་ལྷ་དང་མི་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ཚང་བ་དག་ཐེག་པ་གསུམ་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ།
en: While the Bodhisattva demonstrated austerities for six years, one thousand two hundred billion gods and humans were matured in the Three Vehicles.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་བྱུང་བ།
en: The Bodhisattva left his home

source: །ཡོན་ཏན་དག་དང་ལྡན་པ་དེ།
en: In possession of all good qualities.

source: །སེམས་ཅན་དོན་དང་ཕན་པའི་ཕྱིར།
en: In order to benefit sentient beings,

source: །ཐབས་དང་ལྡན་པའི་བསམ་པ་སྐྱེས།
en: He gave rise to a skillful outlook.

source: །སྙིགས་མ་ལྔ་ཡི་དུས་ཀྱི་ཚེ། །ཆོས་དམའ་མོས་པའི་འཇིག་རྟེན་པོ། །
en: “At the time of the five degenerations, When lowly people devoted themselves to non-Dharma,

source: ལས་དང་བྱ་བོར་འཇིག་རྟེན་དུ། །འཛམ་བུའི་གླིང་འདིར་སྐྱེས་པར་གྱུར།
en: I was born in this world, Where people endowed with leisure practice Dharma.

source: །མུ་སྟེགས་ཚོགས་ཀྱིས་རབ་ཏུ་གང་།
en: “The world is full of extremists,

source: །ལྟད་མོ་དང་ནི་ལྟས་སུ་ལྟ།
en: Who act out of curiosity or for the sake of good luck.

source: །ལུས་ལ་གནོད་པ་བྱ་བ་བྱེད།
en: Making their own bodies into tools,

source: །བྱིས་པ་དེ་དག་དག་པར་སེམས།
en: These childish people think they are purified.

source: །གཡང་ས་མེ་དང་མྱ་ངམ་འཇུག །སྒྲེན་མོ་ས་དང་ལྕི་བས་སྐུད།
en: “They walk into ravines, fire, and desolate areas; Naked, they smear themselves in soil and ashes.

source: །ལུས་ནི་ཡོངས་སུ་གདུང་བའི་ཕྱིར།
en: In order to punish the body,

source: །གདུང་བ་ལྔ་ལ་བརྩོན་དང་ལྡན།
en: They employ the five-fires ritual.

source: །ལག་པ་བརྐྱང་སྟེ་རྒྱུ་བ་དང་། །མི་མཁས་ཁ་ཅིག་ལག་པ་ལྡག །བུམ་པ་ཁར་གཞོང་ལས་མི་ལེན། །སྒོ་དང་ཀ་བས་ཆོད་མི་ལེན།
en: “They commit the error of using mantras; In ignorance they lick their hands. Some do not take food from vases; Others reject offerings near doors and pillars.

source: །གང་ན་ཁྱི་ཡོད་པ་ནས་མིན།
en: “Some won’t take offerings where a dog lives;

source: །འདུག་ཅེའམ་ཚུར་ཤོག་ཅེས་ལས་མིན།
en: Others reject places where they are told to stay or come.

source: །ཁྱིམ་ནས་ཁ་ཟས་གཅིག་ལེན་པས།
en: By receiving a single offering from a house,

source: །བདག་ནི་དག་པར་འགྱུར་སྙམ་སེམས།
en: They think, ‘I have become pure.’

source: །མར་དང་འབྲུ་མར་བུ་རམ་ཞོ། །ཉ་དང་ཤ་དང་འོ་མ་སྤོང་། །ལྡམ་ལྡུམ་སྲེ་ད་པད་མའི་རྩ། །གཟེགས་དང་བ་ལང་ལྕི་བ་ཟ།
en: “Some reject butter, oil, molasses, and yogurt; Others won’t eat fish, meat, and milk. Instead they eat vegetables and grain, Lotus roots and garḍula seeds.

source: །རྩ་བ་འབྲས་བུ་ལོ་མ་ཟ། །ཀུ་ཤ་ཚལ་བུ་ལ་བ་ལྤགས།
en: “Living on roots, fruits, and leaves, They wear grass, mendicant’s robes, and skins.

source: །སྲེལ་བྱེད་ཁ་ཅིག་སྒྲེན་མོར་རྒྱུ།
en: Still others wander naked—

source: །གླེན་པ་འདི་བདེན་གཞན་བརྫུན་སྙམ།
en: Such fools think they have grasped the only truth.

source: །ལག་པ་སྒྲེང་བར་བྱེད་པ་དང་། །སྐྲ་བསྒྲེང་རལ་པ་བསྒྲེང་བ་དག །ལམ་ལས་རབ་ཏུ་རྣམ་པར་ཉམས། །ལམ་མིན་གནས་ཤིང་བདེ་འགྲོ་འདོད།
en: “Some hold up their hand outstretched; Others keep their hair in a braided knot. Straying from the path, They have lost the path, yet they hope for happy rebirths.

source: །རྩྭ་དང་གཏུན་ཤིང་ཐལ་བར་ཉལ།
en: “They sleep on beds of grass, sticks, and ashes;

source: །ཚེར་མར་ཉལ་ཞིང་ཙོག་པུར་འདུག །ཁ་ཅིག་རྐང་པ་གཅིག་པུས་འགྲེང་། །གདོང་བསྟོད་ཉི་དང་ཟླ་ལ་ལྟ།
en: They sleep on thorns or sit upright. Some always stand on one leg, Staring, with their faces upturned, at the sun and the moon.

source: །ཆུ་མིག་མཚོ་དང་ལྟེང་ཀ་དང་། །རྒྱ་མཚོ་ཆུ་བོ་ཉི་ཟླ་དང་། །ཤིང་དང་རི་ཡི་རྩེ་མོ་དང་། །རྫ་དང་ས་ལ་ཕྱག་ཀྱང་འཚལ།
en: “They also venerate springs, lakes, and ponds, The ocean, rivers, the sun, and the moon, Trees and mountain peaks, Rocks and soil.

source: །གླེན་པ་དེ་དག་གནོད་མང་གིས།
en: “These fools use many different methods,

source: །ལུས་ནི་ཡོངས་སུ་སྐོམ་པར་བྱེད།
en: Trying to purify their bodies.

source: །ལོག་པར་ལྟ་དང་ལྡན་པ་དག །མྱུར་དུ་ངན་སོང་རྣམས་སུ་ལྟུང་།
en: Because of their wrong views, They will quickly fall into the lower realms.

source: །ང་ནི་དཀའ་ཐུབ་བརྟུལ་ཞུགས་དང་། །དཀའ་སྤྱད་གང་ཞིག་ལྷ་དང་མིས། །སྤྱད་པར་ནུས་པ་མ་ཡིན་པའི། །དཀའ་སྤྱད་དྲག་པོ་རྩོམ་སྙམ་སེམས།
en: “The intense hardship That I now intend to engage in Will consist of austerities, discipline, and adversities That no god or human can perform.

source: །བསམ་གཏན་གང་ཞིག་རང་རྒྱལ་གྱིས།
en: “My concentration will be one

source: །བལྟ་བར་ནུས་པ་མ་ཡིན་པའི།
en: That even solitary buddhas cannot demonstrate.

source: །རྡོ་རྗེ་ལྟ་བུར་བརྟན་གནས་པ།
en: Stable and firm like a diamond,

source: །མཁའ་ཁྱབ་བསམ་གཏན་བསམ་གཏན་བྱེད།
en: I will now practice the all-pervasive concentration.

source: །མུ་སྟེགས་བརྟུལ་ཞུགས་ངན་པ་ཡིས། །དགའ་བའི་ལྷ་མི་འདི་ན་ཡོད།
en: “There are gods and humans Who delight in the distorted discipline of extremists.

source: །དེ་དག་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར།
en: In order to ripen these beings,

source: །དཀའ་སྤྱད་བརྟུལ་ཞུགས་དྲག་པོ་བརྩམས།
en: I will now practice fierce hardship and discipline.”

source: །ས་སྟེང་ཅི་ཡང་མ་བཏིང་བར། །སྐྱིལ་མོ་ཀྲུང་ནི་བཅས་ཏེ་འདུག །
en: Sitting cross-legged On bare ground,

source: རྒྱ་ཤུག་ཏིལ་དང་འབྲས་འབྲུ་གཅིག །ཟ་བའི་ཆོ་ག་རྣམ་པར་སྟོན།
en: He demonstrated the method of subsisting on A single berry, sesame seed, or rice grain.

source: །དབུགས་དབྱུང་རྔུབ་པ་རྣམ་པར་སྤངས།
en: Cutting off all movements of the breath,

source: །སྟོབས་དང་ལྡན་པ་གཡོ་བ་མེད།
en: Immutable, he showed his strength.

source: །ལོ་དྲུག་བར་དུ་བསམ་གཏན་མཆོག །ནམ་མཁའ་ཁྱབ་ལ་བསམ་གཏན་བྱེད།
en: For six years he practiced the supreme concentration— The all-pervasive concentration.

source: །རྟོག་དང་རྣམ་པར་རྟོག་མེད་པ།
en: Without any conceptual thought,

source: །གཡོ་བ་མེད་ཅིང་སེམས་རྒྱུ་མེད།
en: Immutable and mentally still,

source: །ནམ་མཁའི་ཁམས་སུ་ཁྱབ་པ་ཡི། །མཁའ་ཁྱབ་བསམ་གཏན་བསམ་གཏན་བྱེད།
en: He practiced the all-pervasive concentration That merges with the element of space.
